# FeedThroughLugsIsNotEnabledAndBindGlobalParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElectricalFailures..::..FeedThroughLugsIsNotEnabledAndBindGlobalParam Property
BuiltInFailures..::..ElectricalFailures Class See Also
---
Can't change connection type to Feed Through Lugs because Feed Through Lugs is not enabled. Enable Feed Through Lugs by enabling the global parameter that Feed Through Lugs is mapping. Click Manage tab -> Settings panel -> Global Parameters.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FeedThroughLugsIsNotEnabledAndBindGlobalParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FeedThroughLugsIsNotEnabledAndBindGlobalParam As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FeedThroughLugsIsNotEnabledAndBindGlobalParam {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ElectricalFailures Class
Autodesk.Revit.DB Namespace